20250504T011045--kdoc-369-名前付きパイプは読み書き両方をオープンしてないとブロックする__wiki.org
:properties:
:ID: 20250504T011045
:mtime:    20250518164017
:ctime:    20250504011105
:end:
#+title:      KDOC 369: 名前付きパイプは読み書き両方をオープンしてないとブロックする
#+date:       [2025-05-04 Sun 01:10]
#+filetags:   :wiki:
#+identifier: 20250504T011045

* この文書のステータス
- 作成
  - [X] 2025-05-06 貴島
- レビュー
  - [X] 2025-05-18 貴島

* 概要

名前付きパイプは読み書き両方をオープンしてないと処理がブロックされる。

#+begin_src shell
  man fifo
#+end_src

#+begin_quote
The FIFO must be opened on both ends (reading and writing) before data can be passed. Normally, opening the FIFO blocks until the other end is opened also.
#+end_quote

#+begin_src shell
  mkfifo my_pipe
  cat my_pipe & # 読み込み。これを実行しないと書き込みで止まる
  echo "aaa" > my_pipe # 書き込み
#+end_src

* 関連
なし。
