20250504T011045--kdoc-369-名前付きパイプは読み書き両方をオープンしてないとブロックする__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:06:56Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 369: 名前付きパイプは読み書き両方をオープンしてないとブロックする</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 369: 名前付きパイプは読み書き両方をオープンしてないとブロックする</h1>
<div id="outline-container-orgf384f82" class="outline-2">
<h2 id="orgf384f82"><a href="#orgf384f82">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgf384f82">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-06 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-18 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7a198f5" class="outline-2">
<h2 id="org7a198f5"><a href="#org7a198f5">概要</a></h2>
<div class="outline-text-2" id="text-org7a198f5">
<p>
名前付きパイプは読み書き両方をオープンしてないと処理がブロックされる。
</p>

<div class="org-src-container">
<pre class="src src-shell">man fifo
</pre>
</div>

<blockquote>
<p>
The FIFO must be opened on both ends (reading and writing) before data can be passed. Normally, opening the FIFO blocks until the other end is opened also.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-shell">mkfifo my_pipe
cat my_pipe &amp; <span class="org-comment-delimiter"># </span><span class="org-comment">&#35501;&#12415;&#36796;&#12415;&#12290;&#12371;&#12428;&#12434;&#23455;&#34892;&#12375;&#12394;&#12356;&#12392;&#26360;&#12365;&#36796;&#12415;&#12391;&#27490;&#12414;&#12427;
</span><span class="org-builtin">echo</span> <span class="org-string">"aaa"</span> &gt; my_pipe <span class="org-comment-delimiter"># </span><span class="org-comment">&#26360;&#12365;&#36796;&#12415;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org55b94fb" class="outline-2">
<h2 id="org55b94fb"><a href="#org55b94fb">関連</a></h2>
<div class="outline-text-2" id="text-org55b94fb">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
